import React from "react";

class Greeting extends React.Component {
    constructor(props) {
        super(props);

        this.state = {
            // 1. Створити змінну стейту (за аналогією з лампочкою)
        }
    }

    // 2. Зробити обробник події кліку на h1 (за аналогією з лампочкою)

    // тут можуть бути якісь обробники подій

    render() {
        // 3. В залежності від значення стейту, вирахувати що за текст ви показуєте (за аналогією з лампочкою)

        return <h1>Hello {this.props.name}</h1>
        // P.S. Не забудьте підписати h1 на обробник кліку, розроблений у п.2
    }
}

export default Greeting;

/*

Доробити компоненту таким чином, щоб за натиснення на h1 текст "Hello" змінювався на "Bye"

*/